src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/Интеграции/Интеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Интеграции</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаИнтеграцию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтеграции</name>
    <type>
      <types>EnumRef.СтатусыИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкиИнтеграции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТочекИнтеграции</name>
    <attributes>
      <name>ИнициаторОбмена</name>
      <type>
        <types>CatalogRef.ИнформационныеСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПотокаДанных</name>
      <type>
        <types>EnumRef.НаправленияПотокаДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодВызова</name>
      <type>
        <types>EnumRef.МетодыВызова</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаИнтеграции</name>
      <type>
        <types>CatalogRef.ТочкиИнтеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Функционал</name>
    <attributes>
      <name>Готова</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусИнтеграции</name>
      <type>
        <types>EnumRef.СтатусыИнтеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/НаправленияПотокаДанных/НаправленияПотокаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияПотокаДанных</name>
  <enumValues>
    <name>ОтИнициатора</name>
  </enumValues>
  <enumValues>
    <name>КИнициатору</name>
  </enumValues>
  <enumValues>
    <name>ВОбаНаправления</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/СтатусыИнтеграции/СтатусыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнтеграции</name>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>Выключена</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеРазработки</name>
  </enumValues>
  <enumValues>
    <name>Разработана</name>
  </enumValues>
  <enumValues>
    <name>Неактуальна</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/Интеграции/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТочекИнтеграции

&НаКлиенте
Процедура СписокТочекИнтеграцииИнициаторОбменаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокТочекИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИнициаторОбмена = Объект.Приемник Тогда
		
		// Направление потока данных может быть только "К инициатору" или "В оба направления" для приемника.
		ТекущиеДанные.НаправлениеПотокаДанных = ПредопределенноеЗначение("Перечисление.НаправленияПотокаДанных.КИнициатору");
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФункционал

&НаКлиенте
Процедура ФункционалГотоваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Функционал.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Готова
		И ТекущиеДанные.СтатусИнтеграции <> ПредопределенноеЗначение("Перечисление.СтатусыИнтеграции.Работает") Тогда
		ТекущиеДанные.СтатусИнтеграции = ПредопределенноеЗначение("Перечисление.СтатусыИнтеграции.Разработана");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьДиаграмму(Команда)
	
	СгенерироватьДиаграммуСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеРедактированиеДиаграммы(Команда)
	
	ИсходныйКод = СформироватьИсходныйКодДиаграммыНаСервере();
	ПараметрыФормы = Новый Структура("ИсходныйКод", ИсходныйКод);
	
	ОткрытьФорму("Обработка.ГенерацияUMLДиаграмм.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СгенерироватьДиаграммуСервер()

	ГенерацияUMLДиаграмм = Обработки.ГенерацияUMLДиаграмм.Создать();
	
	ИсходныйКод = СформироватьИсходныйКодДиаграммыНаСервере();
	
	ПараметрыПоУмолчанию = ГенерацияUMLДиаграмм.ПараметрыПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ЭтотОбъект);
	
	Результат = ГенерацияUMLДиаграмм.СгенерированноеИзображение(ИсходныйКод, ПараметрыПоУмолчанию);
	
	Если ЗначениеЗаполнено(Результат.АдресИзображения) Тогда
	 	РезультатОбработкиUML = Результат.АдресИзображения;
	КонецЕсли; 

КонецПроцедуры 

&НаСервере
Функция СформироватьИсходныйКодДиаграммыНаСервере()
	
	ПараметрыИнтеграции = ТочкиИнтеграцииМоделиС4.ПараметрыДиаграммыИнтеграции();
	ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, Объект, "Ссылка, Источник, Приемник");
	ПараметрыИнтеграции.СписокТочекИнтеграции = Объект.СписокТочекИнтеграции.Выгрузить();
	
	МассивИнтеграций = Новый Массив;
	МассивИнтеграций.Добавить(ПараметрыИнтеграции);
	
	ИсходныйКод = ТочкиИнтеграцииМоделиС4.СформироватьКодДиаграммыИнтеграции(МассивИнтеграций);
	
	Возврат ИсходныйКод;

КонецФункции

&НаКлиенте
Процедура ФункционалПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда

        Элемент.ТекущиеДанные.СтатусИнтеграции = ПредопределенноеЗначение("Перечисление.СтатусыИнтеграции.Проект");
        Элемент.ТекущиеДанные.Описание = "";
		
    КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
